name: "flair-ner-english-fast-tokenization"
backend: "python"
default_model_filename: "model.py"
version_policy {
    latest {
      num_versions: 1
    }
  }
max_batch_size: 0

input {
    name: "sentence_bytes"
    data_type: TYPE_INT64
    dims: [ -1 ]
    }

output {
    name: "sorted_lengths"
    data_type: TYPE_INT64
    dims: [ 1 ]
    }

output {
    name: "sentence_tensor"
    data_type: TYPE_FP32
    dims: [ 1, -1, 2148 ]
    }